{
	"0.0.1": [{
		"00": {
			"title": "Registration",
			"description": "Register yourselves and get your goodie bag. Have a great day!",
			"type": "default",
			"speaker": {
				"name": "PyCon India Registeration Team",
				"info": "Bring your Tickets up to the counters and get registered.",
				"photo": "https://images.yourstory.com/2016/06/registration.jpg?auto=compressedu/ICCPM/ImgBanner1/register.jpg"
			}
		},
		"01": {
			"title": "Exploring PyTorch for AI assistance in Medical Imaging",
			"description": "This workshop would be divided into two halfs.\n\nFirst Half: Pytorch Introduction Duration: 1 hour The first half would be a gentle introduction to PyTorch framework. \n\n Second Half: Let’s dive in. Duration: 1 hour 25 minutes.",
			"type": "workshop",
			"speaker": {
				"name": "Abhishek Kumar (~vibrantabhi19) ",
				"info": "DL Scientist @PredibleH, ML Intern | @matelabs_ai. An open source enthusiast & a Linux lover. An Athlete, a RM FC follower, a stand-up comedian.",
				"photo": "https://avatars2.githubusercontent.com/u/6832471?s=460&v=4",
				"social": {
					"website": "https://t.co/nxGGSUorsb",
					"twitter": "https://twitter.com/abhi_kumar07",
					"github": "https://github.com/vibrantabhi19",
					"linkedin": "https://www.linkedin.com/in/abhishek-kumar-74299887/",
					"googleplus": "https://plus.google.com/u/0/+AbhishekKumarTiwari07",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/exploring-pytorch-for-ai-assistance-in-medical-imaging~bqXpa/"
				}
			}
		},
		"02": {
			"title": "Decoding Bollywood with Python and data science",
			"description": "Our Business Is Our Business None Of Your Business…`\n\n Yes, they wish, but we want to know everything about Bollywood!\n\nWho is more popular, Katrina Kaif or Deepika Padukone?\nWhat movie is the most similar to PK based on the storyline?\nWhich city in India is home of the most active actresses and actors?\nAnd lots of other questions. Do you want to know the answers? And even better, would you like to discover them yourself by using Python and popular libraries such as pandas, Gensim and scikit-learn? And cutting-edge data science techniques? Join us for a workshop full of insights where you will be able to answer your own questions while learning the most advanced Python libraries and algorithms.\n\nThe workshop is designed for Python programmers new to data science. Everybody is welcome, but data analysts and people experienced with pandas will find some parts basic.",
			"type": "workshop",
			"speaker": {
				"name": "Marc Garcia & Himanshu Awasthi",
				"info": "Himanshu Awasthi is the organiser of Kanpur Python and PyData Kanpur. Free and open source software enthusiast, and passionate about Python and data analysis, He is currently working for KanpurFOSS organization which organize free technical workshops in India. Yai Workshop… Data Analysis Ke Workshop Hai… Kisi Ke Data Analysis sikha kar He Khatam Hoge...\n\nMarc Garcia is a Python fellow and pandas core developer. He has worked as software engineer and data scientist for companies like Bank of America, Tesco, Unilever or NTT Communications. He is a regular organiser of sprints, and speaker at PyCon and PyData conferences. His favourite actor is Aamir Khan, but wouldn't mind teaching Python to Asin.",
				"photo": "http://paste.opensuse.org/view/raw/85948492",
				"social": {
					"twitter": "https://twitter.com/datapythonista",
					"github": "https://github.com/datapythonista",
					"website": "http://datapythonista.github.io",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/decoding-bollywood-with-python-and-data-science~eEyWe/"
				}
			}
		},
		"03": {
			"title": "Web UI Automation",
			"description": "Do you spend too much time manually testing your user interfaces? Automation is the answer. Python and Selenium offer a simple but powerful framework to script any testing. In this talk, I will show you how to use the combination of Selenium WebDriver and Python code to automate web UI tests. Follow along and learn how to locate elements, navigate pages, test user interactions with forms and drag-and-drop elements, and use waits to control test timing and execution. The lessons are practical and can be immediately applied to your development workflow.",
			"type": "workshop",
			"speaker": {
				"name": "Bhoomika Aggarwal",
				"info": "Bhoomika Agarwal is a developer associate at SAP Labs India. She works in the field of cloud development, machine learning and open source technologies at SAP Labs. Prior to this, she has worked in Sprinklr and completed her graduation in Computer Science from PES Institute of Technology, Bangalore. She has done research in Big Data, Quantum Computing, Linear Algebra and Brain Computer Interface. She has published research papers and given presentations at numerous conferences about these topics. She has published tutorial courses online on Unacamedy and Lynda to disseminate the knowledge she has acquired over the years with experience.",
				"photo": "https://media.licdn.com/dms/image/C5103AQFipi8rEDXnYw/profile-displayphoto-shrink_800_800/0?e=1542240000&v=beta&t=yRrVMlPPd21D0SOZzo58EbOZIYNPqGm-1l24xOihXWo",
				"social": {
					"github": "https://github.com/bhoom10",
					"linkedin": "https://www.linkedin.com/in/bhoomika-agarwal/",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/web-ui-automation-using-selenium~ern4e/"
			
				}
			}
		},
		"04": {
			"title": "Advanced Objected oriented programming",
			"description": "This workshop is dedicated to discuss and extrapolate on the core of Object Oriented Programming its finer details and nuances. The objective of the talk is to introduce concepts that will ensure OOP becomes second nature to a programmer. This is a beginner and an intermediate level talk and is meant to explore OOP concepts in detail.",
			"type": "workshop",
			"speaker": {
				"name": "Vishnu Kiran",
				"info": "I am a Senior Software Engineer/Data scientist at NextOrbit, Technical Architect at Code Matrix. I am a startup guy who loves the idea of building teams and working with them from the ground up. I have been part of and lead teams that have built medium and large scale software. I am glued to the computer a lot, although that must be obvious. But when I am not peeled to a laptop I play badminton, chess, teach students software and find creative reasons to skip a session in the gym on a daily basis.",
				"photo": "https://media.licdn.com/dms/image/C5603AQGY3oTTiOJ-aA/profile-displayphoto-shrink_800_800/0?e=1542240000&v=beta&t=XIDoOPTWhxNLnUwHg7vrF5LJ6RuTphPIlAnO162HmZY",
				"social": {
					"linkedin": "https://www.linkedin.com/in/vishnu-kiran-k-v/",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/advanced-object-oriented-programming~e7MQb/"
				}
			}
		},
		"06": {
			"title": "Free and Open Source libraries of Python for Geo spatial analysis",
			"description": "Geospatial representation are so prevalent in day to day life, such as even in simple travel related conversation to maps, aerial/satellite images etc. In digital era, geospatial data is extensively produced and consumed in ever growing proportion. Python with its free and open source libraries are giving wide variety yet simple and effective set of tools to visualise and analyse geospatial data. The current workshop is directed for beginners of Python programming language, who have basic understanding on computing and data formats. The primary objective of the workshop is to introduce and give hands on training on selected list of FOSS libraries for geospatial analysis. The workshop as a do it yourself fashion tries to solve two real world problems in Geographical Information System (GIS) and its geospatial data sources.",
			"type": "workshop",
			"speaker": {
				"name": "Nishad KA",
				"info": "I am a research associate at UrbanEmissions.info, PhD in Environmental Sciences from Sálim Ali Centre for Ornithology and Natural History, Bharathiar University, Coimbatore. My thesis was on `Particulate air pollution data for Coimbatore, India: real time monitoring and modeling with data-interoperability measures`, which emphasised need of open and standardised real time data for better management of air pollution in the country. I got exposure into programming and open source software related to my research studies. I used free and open source libraries of Python for most of my studies, especially on geospatial data compilation, analysis and visualization. I have conducted workshop similar to the current one in Kovaipy, Scipy-India 2017.",
				"photo": "https://yt3.ggpht.com/a-/AN66SAxdUNwCVJZ9YuYlGvMBwOTifUEYgUEPONisyA=s900-mo-c-c0xffffffff-rj-k-no",
				"social": {
					"proposal": "https://in.pycon.org/cfp/2018/proposals/free-and-open-source-libraries-of-python-for-geo-spatial-analysis-and-visualisationmaps-and-satellite-imageries~aQL5e/"
				}
			}
		},
		"07": {
			"title": "Jupiter Hub Binder",
			"description": "",
			"type": "workshop",
			"speaker": {
				"name": "Carol Willing",
				"info": "Carol Willing is a Python Software Foundation Fellow and former Director, a core developer of CPython and Project Jupyter, and a Research Software Engineer at Cal Poly San Luis Obispo. She's also Geek-In-Residence at Fab Lab San Diego and co-organizes Pyladies San Diego and San Diego Python.",
				"photo": "https://in.pycon.org/2018/img/carol-willing.png",
				"social": {
					"twitter": "https://twitter.com/WillingCarol",
					"website": "http://willingconsulting.com/",
					"proposal": "https://in.pycon.org/cfp/2017/"
				}
			}
		},
		"08": {
			"title": "Designing RESTful APIs",
			"description": "APIs are all around. Everyone talks about RESTful APIs, but what does “RESTful” really mean? This hands-on workshop takes you through everything that you need to know to design great RESTful APIs.",
			"type": "workshop",
			"speaker": {
				"name": "Anand Chitipothu",
				"info": "Anand has been crafting beautiful software since a decade and half. He’s now building a data science platform, rorodata, which he recently co-founded. He regularly conducts advanced programming courses through Pipal Academy. He is co-author of web.py, a micro web framework in Python. He has worked at Strand Life Sciences and Internet Archive.",
				"photo": "https://avatars2.githubusercontent.com/u/7569?s=460&v=4",
				"social": {
					"website": "https://anandology.com",
					"proposal": "https://in.pycon.org/cfp/2017/proposals/kubernetes-101-workshop~b8OWa/",
					"github": "https://github.com/anandology"
				}
			}
		},
		"09": {
			"title": "Scaling Python up and out with Numba and Dask",
			"description": "",
			"type": "workshop",
			"speaker": {
				"name": "Travis E Oliphant",
				"info": "Travis E. Oliphant is a Founder of Quansight and Director/Co-Founder at Anaconda Inc. He has worked with Python for numerical and scientific programming, notably as the primary developer of the NumPy and as a founding contributor of the SciPy",
				"photo": "https://in.pycon.org/2018/img/travis-oliphant.png",
				"social": {
					"twitter": "https://twitter.com/teoliphant",
					"website": "http://technicaldiscovery.blogspot.com/"
				}
			}
		},
		"10": {
			"title": "Understanding NLP - What's the feeling ?",
			"description": "",
			"type": "workshop",
			"speaker": {
				"name": "By Lakshya Sivaramakrishnan",
				"info": "Learner || Listener || Leader || Passionate about Technology, Enjoy Public Speaking and Love Connecting to People",
				"photo": "https://lh3.googleusercontent.com/F1XnhyjRxX9DtiUx_JVMS-9gUa5OUR_lh7Vgau_JxKdVlDCbnykmQUjNQDeDeROX-R6soLY5p9mu=w540-h544-no",
				"social": {
					"twitter": "https://www.twitter.com/lakshyas90",
					"linkedin": "https://www.linkedin.com/pub/lakshya-sivaramakrishnan/67/40/434",
					"website": "https://about.me/lakshya.sivaramakrishnan",
					"github": "https://github.com/lakshya90",
					"googleplus": "https://plus.google.com/105412417430773044496/"
				}
			}
		},
		"11": {
			"title": "Programming a Quantum Computer using Cirq",
			"description": "",
			"type": "workshop",
			"speaker": {
				"name": "By Vamsi Krishna Devabathini",
				"info": "I deal with Artificial Intelligence (well, many know it is as Hollywood movie's genre) and Quantum Computing(here Hollywood has to seriously catch-up) at Google. At some point in my life, I experimented with research in Quantum Computing at CQT, NUS Singapore (PhD drop out :( ). I also tried to wrap my head around business thoughts from HBX CORe, Harvard Business School. I received my Masters in Interactive Intelligence from the College of Computing, Georgia Tech. I also hold a Bachelors degree in Computer Science from Indian Institute of Technology, Madras.",
				"photo": "https://lh3.googleusercontent.com/RAs-5AlVlRH0BV8yMyvdEyKiKHsoOXUQl6ZeS94D4zO6_e4vcBy6f8_zIUxnS4tdCUF4ItWIVNmkJw=w638-h618-no",
				"social": {
					"linkedin": "https://in.linkedin.com/in/vamsikrishnadevabathini",
					"website": "https://sites.google.com/view/vamsikrishna-devabathini",
					"github": "https://github.com/iamvamsi",
					"googleplus": "https://plus.google.com/+vamsikrishna_devabathini"
				}
			}
		},
		"12": {
			"title": "Python ML On the Cloud",
			"description": "",
			"type": "workshop",
			"speaker": {
				"name": "By Lakshya Sivaramakrishnan",
				"info": "",
				"photo": "https://media.licdn.com/dms/image/C5103AQGuxye9qq4U5g/profile-displayphoto-shrink_200_200/0?e=1544054400&v=beta&t=Mnnc51rGpYKyE0FDL_1Dm8fsAkiCCIBHcM87mmaYmvw",
				"social": {
					"linkedin": "https://in.linkedin.com/in/krishna-chaitanya-balaga-14908258",
					"website": "http://www.smartifyme.in"
				}
			}
		},
		"14": {
			"title": "Keynote",
			"description": "",
			"type": "talk",
			"speaker": {
				"name": "Armin Ronacher",
				"info": "Armin Ronacher is the creator of the Flask Web Framework and principal software engineer at sentry.io. He is leading an engineering team in Vienna Austria working on Sentry and a frequent speaker at tech and open source conferences.",
				"photo": "https://in.pycon.org/2018/img/armin-ronacher.png",
				"social": {
					"twitter": "https://twitter.com/mitsuhiko",
					"website": "http://lucumr.pocoo.org/"
				}
			}
		},
		"15": {
			"title": "How Helpshift built machine learning platform using Python at large scale",
			"description": "The purpose of this talk is to describe how helpshift has leveraged python ecosystem to build a machine learning platform without using any third party framework, and how you can build one too.\n\nIn particular, You can learn how to build the following components of machine learning platform using python from this talk.",
			"type": "talk",
			"speaker": {
				"name": "Shyam Shinde",
				"info": "Hello, I am shyam shinde, actively developing machine learning platform at helpshift.\n\n\nI have diverse experience in developing backend systems, designing and developing system to handle big data.\n\nDeveloped production systems using Java, Clojure and Python. Currently, interested in deploying machine learning services at scale. As side projects, I learn machine learning concepts and try to implement them.\n\nApart from that, I like trekking, reading books and watching movies.",
				"photo": "https://yt3.ggpht.com/a-/AN66SAxdUNwCVJZ9YuYlGvMBwOTifUEYgUEPONisyA=s900-mo-c-c0xffffffff-rj-k-no",
				"social": {
					"linkedin": "http://linkedin.com/in/shyam-shinde-4a867224",
					"github": "https://github.com/shindesh1",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/how-helpshift-built-machine-learning-platform-using-python-at-large-scale~e0mLa/"
				}
			}
		},
		"16": {
			"title": "Large scale web crawling using Python",
			"description": "The purpose of this talk is to describe how helpshift has leveraged python ecosystem to build a machine learning platform without using any third party framework, and how you can build one too.\n\nIn particular, You can learn how to build the following components of machine learning platform using python from this talk.",
			"type": "talk",
			"speaker": {
				"name": "Anand B Pillai & Noufal Ibrahim",
				"info": "Anand B Pillai is a technology professional with 20 years of software development, design and architecture. He has worked in a number of companies over the years in fields ranging from Security, Search Engines, Large Scale Web Portals and Big Data. He is the founder of the Bangalore Python User's Group and the author of Software Architecture with Python (PacktPub, April 2017). Anand has a lot of experience in web-crawling having written the original Python web-crawler HarvestMan in 2005 and developing a number of custom crawlers for various startups solving various problems. Anand is an Independent Software Professional.\n\nNoufal Ibrahim is the CEO and Founder of Hamon Technologies at Calicut, Kerala. He was key to starting the very first PyCon India conference in 2009 and has since been involved in the conference closely throughout the years. Noufal was the keynote speaker of PyCon India 2017. Noufal has made a name not just by his Python community activities, but also by his creative Python introductory talks he has conducted in various universities and institutions in Kerala. He is also a professional trainer in Python and git.\n\nBoth Noufal and Anand are Fellows of the Python Software Foundation (PSF).",
				"photo": "http://paste.opensuse.org/view/raw/10686651",
				"social": {
					"twitter": "https://twitter.com/skeptichacker",
					"website": "http://hamon.in/",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/large-scale-web-crawling-using-python~bkl6d/"
				}
			}
		},
		"17": {
			"title": "Creating 3rd generation Web APIs using Hydra and Hydrus",
			"description": "3rd generation Web APIs enables the creation of truly RESTful services with all its benefits in terms of scalability, maintainability, and evolvability. This allows creating Generic Consoles and loosely coupled clients. The main objective of this talk is to provide an overview of Hydra and Hydrus and how we can create such APIs using Hydrus.",
			"type": "talk",
			"speaker": {
				"name": "Akshay Dahiya",
				"info": "Hi, my name is Akshay Dahiya. I'm a Mentor and Organization Admin for Python Hydra in Google Summer of Code 2018 and I love working on Semantic Web and Artificial Intelligence-related projects.\nI also mentor a couple of students across various Udacity Nanodegree programs (FullStack Nanodegree, React Nanodegree and Deep Learning Nanodegree) in my free time.",
				"photo": "https://media.licdn.com/dms/image/C4E03AQHXk2hEjl0z0w/profile-displayphoto-shrink_200_200/0?e=1544054400&v=beta&t=3wVnzwg76YwPGXOXGPXVQsNd2fZn8yQr7h_ZoOQkEcg",
				"social": {
					"github": "https://github.com/xadahiya/",
					"website": "http://www.xadahiya.me/",
					"linkedin": "https://www.linkedin.com/in/xadahiya/",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/creating-3rd-generation-web-apis-using-hydra-and-hydrus~dBpYa/"
				}
			}
		},
		"18": {
			"title": "Python Project Workflows - Continuous Deployment Friendly",
			"description": "Have conflicting dependencies (unpleasantly) surprised you? (Darn: It worked on my laptop!)\nDo deterministic builds matter?\nWhat about those run-time errors, which were a typo while accessing an attribute of a class?\nHas the codebase already started smelling a bit?\nUnit tests and what about Dockerization?\nTypically, when your Python project grows beyond a few modules and your team size is more than a couple of developers, having the right tools built into your project development workflow saves one from a lot of surprises (and perhaps late night calls). In this talk, we start with challenges typically seen in Python Projects and look at ways of overcoming them, so that the velocity of code deployment increases. Specifically we are going to be looking at tools that are out there that allow you to -",
			"type": "talk",
			"speaker": {
				"name": "Abhijit Gadgil",
				"info": "Running a Consulting Company 'hyphenOs Software Labs' in Pune, India.\n\nPython/Go programmer - Mostly for things that pay the bills and ideas that I want to try out.\n\nDatacenter Networking Enthusiast (hacking a yet another Container Networking technology, borrowing ideas from different Projects)\nEternally grateful to whoever wrote tcpdump and the new Wireshark. Number of problems solved using these tools could run into triple digits.\nHates trailing white spaces in a file.",
				"photo": "https://avatars3.githubusercontent.com/u/387214?s=400&v=4",
				"social": {
					"github": "https://github.com/gabhijit",
					"linkedin": "https://www.linkedin.com/in/amgadgil/",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/python-project-workflows-continuous-deployment-friendly~bq8ya/"
				}
			}
		},
		"19": {
			"title": "Sponsor Talk - DEShaw\nPyflyby: Automatic imports for Python",
			"description": "",
			"type": "talk",
			"speaker": {
				"name": "Karl Chen",
				"info": "Vice President at D. E. Shaw & Co. New York, New York",
				"photo": "https://media.licdn.com/dms/image/C4E03AQH_W9JeSHICAQ/profile-displayphoto-shrink_800_800/0?e=1544054400&v=beta&t=6dNjlOAuCvHsIuryGeQFUlcLCA8FP2Mv72H-jfmvYv8",
				"social": {
					"linkedin": "https://www.linkedin.com/in/quarl/"
				}
			}
		},
		"20": {
			"title": "Language Model (Text Analysis) using Python from scratch",
			"description": "What is Language Model?\n\nLanguage Model is basically a way to determine how likely a certain sentence is in the language. 'You are reading my LM write up now ' is more likely to be said than `Now you are my LM reading write up`, even though both sentences contain only correct English words; and the sentence `I had ice-cream with a` is more likely to end with `spoon` than with `banana`. LM helps impart this understanding of a language to machines.\n\nWhat’s the need? `Computers are incredibly fast, accurate and stupid; humans are incredibly slow, inaccurate and brilliant; together they are powerful beyond imagination.` (Albert Einstein)",
			"type": "talk",
			"speaker": {
				"name": "Divya Choudhary",
				"info": "Data Scientist with ~4 years of experience. For more info, please pay a visit to my LinkedIn.",
				"photo": "https://media.licdn.com/dms/image/C5603AQFbbWt9_kRVzw/profile-displayphoto-shrink_800_800/0?e=1544054400&v=beta&t=Yl14rl2E9CNpBtgC0YLdfO7w6iWc6l5k3Iroo2xNyUY",
				"social": {
					"linkedin": "https://www.linkedin.com/in/divyachoudhary28/",
					"proposal": "https://in.pycon.org/cfp/2018/proposals/python-project-workflows-continuous-deployment-friendly~bq8ya/"
				}
			}
		},
		"34": {
			"title": "Keynote",
			"description": "",
			"type": "talk",
			"speaker": {
				"name": "Siddu Ponappa",
				"info": "Sidu is 4x a Founder/CEO, 3x a failure, 1x profitable and 1x exit. His last venture, C42 Engineering was acquired by GO-JEK in 2015. Now, he handles Data Engineering, Tech People Operations and Tech Recruiting at GO-JEK. He is also a trustee of the Emerging Technology Trust, which organizes RubyConf India, GopherCon India and DevopsDays ",
				"photo": "https://in.pycon.org/2018/img/sidu-ponnappa.png",
				"social": {
					"twitter": "https://twitter.com/ponnappa",
					"website": "http://sidu.in"
				}
			}
		},
		"35": {
			"title": "Keynote",
			"description": "",
			"type": "talk",
			"speaker": {
				"name": "Travis E Oliphant",
				"info": "Travis E. Oliphant is a Founder of Quansight and Director/Co-Founder at Anaconda Inc. He has worked with Python for numerical and scientific programming, notably as the primary developer of the NumPy and as a founding contributor of the SciPy.",
				"photo": "https://in.pycon.org/2018/img/travis-oliphant.png",
				"social": {
					"twitter": "https://twitter.com/teoliphant",
					"website": "http://technicaldiscovery.blogspot.com/"
				}
			}
		},
		"54": {
			"title": "Keynote",
			"description": "",
			"type": "talk",
			"speaker": {
				"name": "Carol Willing",
				"info": "Carol Willing is a Python Software Foundation Fellow and former Director, a core developer of CPython and Project Jupyter, and a Research Software Engineer at Cal Poly San Luis Obispo. She's also Geek-In-Residence at Fab Lab San Diego and co-organizes Pyladies San Diego and San Diego Python.",
				"photo": "https://in.pycon.org/2018/img/carol-willing.png",
				"social": {
					"twitter": "https://twitter.com/WillingCarol",
					"website": "http://willingconsulting.com/",
					"proposal": "https://in.pycon.org/cfp/2017/"
				}
			}
		},

		"97": {
			"title": "Lunch",
			"description": "Delicious Hyderabadi cuisine",
			"type": "workshop",
			"speaker": {
				"name": "HICC Caterors",
				"info": "Gourmet? Street? What will be served?",
				"photo": "https://az727346.vo.msecnd.net/content/images/lunch-combos/lunch-combos-soup-salad-170721-v2.png"
			}
		},
		"98": {
			"title": "Tea",
			"description": "",
			"type": "talk",
			"speaker": {
				"name": "HICC Caterors",
				"info": "",
				"photo": "https://cdn-a.william-reed.com/var/wrbm_gb_food_pharma/storage/images/1/9/0/2/3052091-1-eng-GB/Habitual-tea-consumption-may-help-reduce-arterial-stiffness.jpg"
			}
		},
		"99": {
			"title": "Lightning Talks",
			"description": "A lightning talk is a very short presentation lasting only a few minutes, given at a conference or similar forum. Several lightning talks will usually be delivered by different speakers in a single session, sometimes called a data blitz.\n\n Any one can give a talk on any topic related to the event.",
			"type": "talk",
			"speaker": {
				"name": "Every one",
				"info": "",
				"photo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR8vFmQ9PPGjnlW4QxmYuaDylIWe-iVptOd_qwz4OEwvCOTz86Abg"
			}
		},
		"100": {
			"title": "Closing Ceremony",
			"description": "",
			"type": "talk",
			"speaker": {
				"name": "By Manivannan Elangovan, Chair - PyCon India 2018",
				"info": "",
				"photo": "http://paste.opensuse.org/view/raw/14567693"
			}
		}
	}]
}
