{
	"0.0.1": [
		{
			"00": {
				"title": "Registration and Breakfast",
				"description": "Register yourselves and get your goodie bag. Have a great day!",
				"type": "default",
				"speaker": {
					"name": "",
					"info": " The team of PyDelhi would help you to get registered for the event.\n Please lineup on the registration counter at the entrance of the venue.",
					"photo": "https://cdn2.iconfinder.com/data/icons/healer-flat-vol-1/201/registration-reservation-admission-cashier-512.png"
				}
			},
			"01": {
				"title": "Opening Ceremony",
				"description": "Opening Ceremony with PyDelhi Community and Delhi University Guests",
				"type": "default",
				"speaker": {
					"name": "",
					"info": "Official opening of PyDelhiConf 2023. Our presenters Anuvrat Parashar and Dr Sanjeev Singh, would be introducing our special guests to the audience and asking them to speak a few word about the event.",
					"photo": "http://www.newscaststudio.com/wp-content/uploads/2016/07/2016-rio-olympics-opening-ceremony-promo.png"
				}
			},
			"02": {
				"title": "Keynote",
				"description": "",
				"type": "keynote",
				"speaker": {
					"name": "Sarabjot Singh",
					"info": "Sarabjot Singh is Co-founder and Chief Data Scientist @TatrasData Co-founder @SabudhF Associate Professor at the University of Warwick, UK",
					"photo": "https://media.licdn.com/dms/image/D4D03AQEezegI1mgevQ/profile-displayphoto-shrink_800_800/0/1677217744772?e=2147483647&v=beta&t=fYduQT0FKUJYyVYaEiNbYi7U4QgTHq4qc0n4GIEYYwY",
					"social": [
						{
							"linkedin": "https://www.linkedin.com/in/sarabjot-singh-anand/"
						}
					]
				}
			},
			"03": {
				"title": "Networking Session",
				"description": "Food & Beverages",
				"type": "default",
				"speaker": {
					"name": "",
					"info": "Afternoon tea is a creative way to build relationships. ... a spa, something special to add to a meeting agenda without the sweating",
					"photo": "http://www.telegraph.co.uk/content/dam/Food%20and%20drink/2015-09/25sept/green-tea-alamy-large.jpg"
				}
			},
			"04": {
				"title": "Deploying Python on the edge: Mistakes, pain and learnings of scaling Python applications on millions of IoT devices",
				"description": "Unlock the power of Python on the edge! Optimize your deployments for resource-constrained uptime-critical environments. Join the session to level up your IoT applications using Python.Especially focused on data mining, automotive, computer vision, and AI applications.",
				"type": "talk",
				"speaker": {
					"name": "Vipul Gupta",
					"info": "Vipul Gupta is a software developer specializing in IoT applications, open-source docs, and sustaining communities. Occasionally reads, meticulously documents, and continuously automates, Vipul has been part of various programs like Google Summer of Code, & Google Code-in as a mentor.",
					"photo": "https://avatars.githubusercontent.com/u/22801822?v=4",
					"social": [
						{
							"website": "https://mixster.dev/",
							"github": "https://github.com/vipulgupta2048/",
							"proposal": ""
						}
					]
				}
			},
			"05": {
				"title": "[IWantOut] Subreddit Insights with NetworkX",
				"description": "Explore the potential of NetworkX to transform raw data into vibrant visualizations, extract meaningful insights, and map global connections using data scraped from the [IWantOut] subreddit, a community of people who dream of relocating from their country of origin to another country.",
				"type": "talk",
				"speaker": {
					"name": "Navya Agarwal",
					"info": "I am Navya Agarwal, a second-year Computer Science undergrad at IGDTUW. I am currently an intern with NetworkX as part of the Outreachy program. I like to play around with websites and datasets, and I love contributing to open source. I have previously published a research paper that you can check out on my profile! I am also the co-founder of my college's first-ever Data Science club, The Arc.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQHP66qv0ftNyw/profile-displayphoto-shrink_400_400/0/1682079757699?e=1695859200&v=beta&t=jbXr3v3gJjXVUe34mDGqph-hpkJeRrjGYU2v3ndRgL8",
					"social": [
						{
							"twitter": "",
							"github": "https://github.com/navyagarwal",
							"website": "https://navyaagarwal.com/",
							"proposal": ""
						}
					]
				}
			},
			"06": {
				"title": "Python dictionaries under the hood",
				"description": "While interviewing a lot of engineers for my team in the past two years, I discovered how incorrectly people perceive the implementation of hashmaps / dictionaries in Python.In this talk, we go through the core implementation of a python dictionary and debunk such misconceptions.",
				"type": "talk",
				"speaker": {
					"name": "Peeyush Aggarwal",
					"info": "I work as a backend engineer at airbases where I deal with credit cards and real time transactions. Airbase is the 3rd startup I am working with. Both the two startups I worked earlier were acquired. One of those was a marketing automation startup where I worked as a backend and devops engineer. The other one was a AI chatbot startup where I worked as an NLP engineer.",
					"photo": "https://media.licdn.com/dms/image/C5103AQHepJGluDdPpA/profile-displayphoto-shrink_400_400/0/1533559693467?e=1695859200&v=beta&t=3UpvaMN6-LPgnb3SfV7FrlqQXrUY12y-PINQYMiSvGQ",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": ""
						}
					]
				}
			},
			"07": {
				"title": "Pragmatic Zen of Python",
				"description": "Python is widely recognized as an easy-to-use programming language. However, this simplicity can sometimes lead to unforeseen challenges. The Zen of Python serves as a foundational framework, providing guiding principles that, when applied, help to avoid such pitfalls. Often, when working on quick prototypes, it is common for code to be hastily developed and deployed without thorough consideration. This can result in numerous potential issues arising in a production environment. In order to address this, we aim to revisit the concepts of the Zen of Python and explore how they can be effectively applied in typical scenarios. The goal is to produce high-quality code that is safe for production, minimizing the potential for any detrimental impacts.The subject of this talk is not new or unique. Similar topics have been covered in other PyCon chapters. The intended audience is beginners, with the goal of sharing insights and inviting audience participation to explore beyond the topics I have already mentioned.",
				"type": "talk",
				"speaker": {
					"name": "Shantanu",
					"info": "Developer",
					"photo": " ",
					"social": [
						{
							"twitter": "",
							"github": "https://github.com/baali",
							"proposal": ""
						}
					]
				}
			},
			"08": {
				"type": "talk",
				"title": "PyTest Optimization - Supercharging Your CircleCI Pipeline for Efficient Testing",
				"description": "Are you tired of lengthy testing pipelines? Whether it's waiting for tests to complete, dealing with flaky test cases, or re-running tests due to merges, it can be frustrating. If you can relate, then this is the talk for you.",
				"speaker": {
					"name": "Martin Siby",
					"info": " Martin Siby  works As a Senior Backend Engineer at Certa, I have the privilege of working on solving third-party ingestion challenges for enterprises like Walmart. My focus lies in serverless technology and cloud integration using Python.Beyond my professional endeavours, I find joy in optimizing infrastructure and pipelines as a hobby. It's a fascinating adventure that keeps me on my toes, constantly seeking ways to improve and streamline systems.",
					"photo": "https://media.licdn.com/dms/image/D5603AQFnsCxZoWghlw/profile-displayphoto-shrink_400_400/0/1667543336542?e=1695859200&v=beta&t=Bx4w0D6N3h1NLssSYGydxxqhJrEM8bwS0fCJpvnAKsw",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/martin-siby/",
							"proposal": ""
						}
					]
				}
			},
			"09": {
				"type": "default",
				"title": "Lunch",
				"description": "Lunch time",
				"speaker": {
					"name": "",
					"info": "",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"10": {
				"type": "default",
				"title": "Lightning Talks",
				"description": "4 Lightning Talks",
				"speaker": {
					"name": "",
					"info": "",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"11": {
				"type": "keynote",
				"title": "Keynote: Python as a Gateway Language to Open Source",
				"description": "Python has emerged as an excellent gateway language to open-source development for several reasons. Its simplicity, versatility, and large community make it an attractive choice for beginners looking to contribute to open-source projects. In this session, we will discuss and explore on what makes python a good candidate as a gateway language to open-source.",
				"speaker": {
					"name": "Manik Sidana",
					"info": "A dynamic individual with 15+ years of experience. Throughout his career, Manik has successfully built products from scratch and led multiple teams. Apart from his professional work, he has a strong inclination towards open-source projects and has made significant contributions to projects like OpenStack, Perfkit, CNCF, and others. Moreover, Manik is a key member of the Akraino Technical Steering Committee and serves as the technical lead for the Akraino project Kontour, which focuses on defining Edge KPIs. He possesses expertise in cloud benchmarking, and his passion for coding and reading continues to drive his professional growth.",
					"photo": "https://media.licdn.com/dms/image/C4D03AQEjs034ZprCsw/profile-displayphoto-shrink_800_800/0/1516556715045?e=1697068800&v=beta&t=DF8hMJSSITRIWqPH0qBKaXJGC9ja3bqcLAurotQcIeQ",
					"social": [
						{
							"twitter": "https://twitter.com/manik019",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/maniksidana/",
							"proposal": ""
						}
					]
				}
			},
			"12": {
				"type": "talk",
				"title": "From chaos to order - Leveraging AWS Step Functions for Streamlined Data Processing",
				"description": "Discover the art of efficient data processing with AWS Step Functions! Let's dive into a world of streamlined workflows, scalable solutions, and seamless automation as we unravel the secrets to transforming your data processing pipelines into a well-oiled (state) machine.",
				"speaker": {
					"name": "PS Solanki",
					"info": "My name is Pankaj Singh Solanki. I am a Senior Backend Engineer at Certa. I work on enhancements to the integration abilities of Certa products and work closely with engineering, product and external teams.I am an avid computer science enthusiast and I love to stay on top of the most recent tech trends. I am very active in open source communities (github/pssolanki111). I also maintain and participate in many communities across discord, gitter and slack.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQH-uCRhx8SuNQ/profile-displayphoto-shrink_800_800/0/1691381696662?e=1697673600&v=beta&t=W6PglMvdh8Fv0saPtxnz72cmJpYrWC6c8vqe-PWWfak",
					"social": [
						{
							"twitter": "http://twitter.com/_pssolanki",
							"github": "https://github.com/pssolanki111",
							"website": "pssolanki.com",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"13": {
				"type": "talk",
				"title": "Django Custom Permissions and Authorization: Implementing Fine-Grained Access Control",
				"description": "I invite you to join me in exploring the world of fine-grained access control in Django! In our tech talk on “Custom Permissions & Authorization,” we will go through customizing permissions, implementing RBAC, managing dynamic access, and ensuring rock-solid security.",
				"speaker": {
					"name": "Mayank S Jha",
					"info": "Hi, I'm a full stack engineer working out of Gurgaon, India. My skillset involves web development technologies such as python, django, typescript, node.js and react. I also have experience with cloud technologies, namely, AWS. I'm always interested to learn about new opportunities and grow myself in a way that allows me to help others and give back.",
					"photo": "https://media.licdn.com/dms/image/D5603AQGIurzDelFurw/profile-displayphoto-shrink_400_400/0/1682484647680?e=1695859200&v=beta&t=PkY0IuVDRT37CSWMm8r0Ow_D5KZzrUmLzrb0NQoanBA",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/mayanksjha/",
							"proposal": ""
						}
					]
				}
			},
			"14": {
				"type": "talk",
				"title": "Open Source Culture: Fostering Inclusivity and Diversity in Tech Communities",
				"description": "My talk will focus on the importance of creating a diverse and inclusive tech community and how open source culture can help us achieve this goal. We will discuss the benefits of working in an inclusive environment, and how you can get involved in open-source projects.",
				"speaker": {
					"name": "Ayush Kumar",
					"info": "Open Source Culture: Fostering Inclusivity and Diversity in Tech Communities” is an inspiring and informative talk that aims to ignite a profound shift towards creating more inclusive and diverse tech communities within the open-source movement. This engaging session delves into the importance of cultivating a culture that embraces and celebrates the unique perspectives, backgrounds, and talents of individuals from all walks of life.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQFjwlbUGVp0CQ/profile-displayphoto-shrink_400_400/0/1690229689659?e=1695859200&v=beta&t=p15sQ34axgsdxX76S2IdBnAGk9f-H5onOveKMNGEibY",
					"social": [
						{
							"twitter": "https://twitter.com/AyushKu38757918",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/ayush-kumar-984443191/",
							"proposal": ""
						}
					]
				}
			},
			"15": {
				"type": "talk",
				"title": "Python Inspector - Look Ma No Hands!",
				"description": "Do you know pip does not support reporting resolved dependencies without actually installing them in a build and depends on run-time environment for the resolution? Python-Inspector comes to rescue here by doing platform independent resolution without building anything : )",
				"speaker": {
					"name": "Tushar Goel",
					"info": "python-inspector is a tool to resolve Python dependencies without actually building or installing anything and does not depend on the runtime operating system and Python version to resolve a dependencies graph. This grew out of a need to resolve dependencies on demand and anywhere. In contrast, pip does not support resolving dependencies without installing or building them. These installations and the underlying dependency resolutions are only for the current Python version and runtime used to run pip that may not be the target version and OS we want to resolve dependencies for.",
					"photo": "https://media.licdn.com/dms/image/C4E03AQFtDZd3FQWkkA/profile-displayphoto-shrink_800_800/0/1596570555063?e=1697673600&v=beta&t=VWVXB-tadQAQivxMMPmmw_VocmvlQR_7s9Q3PAs5UBY",
					"social": [
						{
							"twitter": "https://twitter.com/caught_nd_bowld",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/tushar-goel-53b09411a/",
							"proposal": ""
						}
					]
				}
			},
			"16": {
				"type": "default",
				"title": "Networking Session",
				"description": "Team Time",
				"speaker": {
					"name": "",
					"info": "",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"17": {
				"type": "workshop",
				"title": "Unleash the Power of Python: Automated Testing for Units, Functions, and APIs",
				"description": "In today's rapidly evolving software landscape, robust testing is paramount to deliver high-quality products. Manual testing is time-consuming and error-prone, often resulting in inefficiencies and bottlenecks. This workshop is designed to empower you with the knowledge and tools required to automate your testing workflows.",
				"speaker": {
					"name": "Shailendra Pratap Singh",
					"info": "An enigmatic professional with 20 years of experience, Head of Quality Assurance at Coredge, dedicated to driving excellence in software quality and automation. Holds a master's degree in computer applications and has served as Quality Head, QA Department Head, and Automation Architect. Contributed to shaping quality standards at Rakuten, XEBIA, Oracle, and Birlasoft.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQHAK9vaxerrtg/profile-displayphoto-shrink_800_800/0/1667495038950?e=1697673600&v=beta&t=CQvKm5DdBlHWgHJ4Bt78yPnh7MKkBXh4BcYWNC_r6LY",
					"social": [
						{
							"twitter": "https://twitter.com/QAShailendra",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/shailendra-pratap-singh-38268222/",
							"proposal": ""
						}
					]
				}
			},
			"18": {
				"type": "workshop",
				"title": "Quantum Quest: Exploring Quantum Computing in Python",
				"description": "Join us on a captivating journey through the realm of Quantum Computing with Python! Discover the extraordinary potential of qubits, unravel mind-bending concepts like superposition and entanglement, and witness how Python empowers us to harness the power of quantum algorithms.",
				"speaker": {
					"name": "Divyansh Dwivedi",
					"info": "Hello, I'm Divyansh Dwivedi, an ex-tech lead at Get My Parking, co-founder@NowIntern, founder@NellStudios and a coding enthusiast with over 12+ years of experience. Since my coding journey began in 2009, I have been captivated by the world of technology. I firmly believe that “Technology is the real superpower in this 21st century.",
					"photo": "https://static.wixstatic.com/media/46775d_a7c15e3c2e2b4d5e85615c922225811e~mv2.jpg/v1/crop/x_2,y_0,w_370,h_368/fill/w_206,h_205,al_c,q_80,usm_0.66_1.00_0.01,enc_auto/IMG_0066_edited.jpg",
					"social": [
						{
							"twitter": "https://twitter.com/justdvnsh",
							"github": "",
							"website": "https://www.divyansh.co/",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"19": {
				"type": "workshop",
				"title": "Scaling ML Models on SageMaker",
				"description": "Scaling ML Models using SageMaker, this is a Hands on Workshop with experts from AWS",
				"speaker": {
					"name": "Sanjay Kumar Tiwary",
					"info": "Sanjay is a Specialist Solutions Architect at AWS India for the Worldwide Public Sector. He collaborates with the Public Sector team to assist government agencies, public sector undertakings, educational institutions, healthcare organizations, and non-profit organizations in adopting AWS Cloud services.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQEaXCF7AXrUeg/profile-displayphoto-shrink_800_800/0/1679109925449?e=1697068800&v=beta&t=4akH3MyAuIDvZBy3K7Io0H7Sgt6sQfW6Op06sreTPw8",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/sanjay-tiwary-6a363748/",
							"proposal": ""
						}
					]
				}
			},
			"20": {
				"type": "default",
				"title": "Registration and Breakfast",
				"description": "Registration",
				"speaker": {
					"name": "",
					"info": "",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"21": {
				"type": "keynote",
				"title": "Keynote: Python: A Catalyst for Builders",
				"description": "Explore how Python, with its rich ecosystem and versatility, empowers builders across diverse domains. From rapid prototyping to large-scale cloud deployments, delve into Python's transformative role, making development efficient and accessible. From SDLC to MLOps to Generative AI solutions, learn why Python stands as the preferred tool for modern-day innovators aiming for scalable, efficient solutions",
				"speaker": {
					"name": "Sachin Punyani",
					"info": "Sachin Punyani leads the Business Development of AI/ML, Analytics and IoT for India and South Asia with AWS and is helping AWS customers in modernizing their applications by integrating AI/ML and IoT capabilities in their business solutions. He has helped multiple Govt. and Industry organizations blend their domain expertise with new technology to build solutions that have citizen impact. He is certified in Big Data, Analytics and Machine Learning Specialties and holds multiple master degrees in various branches of IT and carries more than 16 years of experience in architecting and implementing scalable enterprise architectures.",
					"photo": "https://media.licdn.com/dms/image/C4D03AQH-PGvka-OhoQ/profile-displayphoto-shrink_800_800/0/1598376311693?e=1697068800&v=beta&t=2e7pKr3tAF13-HsoyW7O-aftiiqMpdLICi0DrLYPtMY",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/sachin-punyani/",
							"proposal": ""
						}
					]
				}
			},
			"22": {
				"type": "default",
				"title": "Networking Session",
				"description": "",
				"speaker": {
					"name": "",
					"info": "",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"23": {
				"type": "Talk",
				"title": "What are JIT Compilers",
				"description": "We all know Python is an interpreted programming language - but is it really? does it have to be? Let's clarify the misconceptions of what Python really is … and go into concepts of compilers and interpreters to understand what kind of a beast python really is !",
				"speaker": {
					"name": "Abdeali Kothari",
					"info": "In this talk, we will first clarify the common misconception of what a language is. And what the Python language is.And go into various alternatives of the standard CPython that are available, and the key reason they exist (i.e. why not use CPython?) Then we will go into some of the choices CPython has made - specifically about being interpreted vs compiled.",
					"photo": "/img/abdeali-kothari.jpeg",
					"social": [
						{
							"twitter": "https://twitter.com/AbdealiLoKo",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"24": {
				"type": "Talk",
				"title": "Writing a Python interpreter from scratch",
				"description": "Python's interpreter does a lot of things for you: checks the syntax is valid and properly indented, imports modules, and runs your code step by step.But if you've ever wondered how exactly it happens, this talk will teach you the whole process, by making a working python interpreter from scratch.",
				"speaker": {
					"name": "Tushar Sadhwani",
					"info": "The plan is to write a really simple, but working interpreter that can run Python code, with zero dependencies.",
					"photo": "https://avatars.githubusercontent.com/u/43412083?v=4",
					"social": [
						{
							"twitter": " https://twitter.com/sadhlife",
							"github": "",
							"website": "https://tushar.lol/",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"25": {
				"type": "Talk",
				"title": "Playwright for Browser automation and E2E",
				"description": "Browsers are our entrypoint into the internet, and have become one of the most commonly used app.Learn to control your browser programmatically in an easy way with Python and Playwright. Speed up your data scraping scripts or improve the way you test your web application !",
				"speaker": {
					"name": "Abdeali Kothari",
					"info": "I have tried multiple frameworks for these tasks. With loads of attempts with selenium, webdriver, cypress, etc. and even hacky approaches like AutoIt, recorders, karma, etc. I finally stumbled upon the combination of playwright + python which has worked phenomenally well for us. I'd like to discuss this case study as I am sure this is a problem many people in the world must be facing. I have seen many discussions about the issues E2E testing poses - but never a “solution” to them, which is what I'd like to discuss.",
					"photo": "/img/abdeali-kothari.jpeg",
					"social": [
						{
							"twitter": "https://twitter.com/AbdealiLoKo",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"26": {
				"type": "Talk",
				"title": "Rust for Python Developers",
				"description": "Decode the hype around Rust — a language that offers modern solutions for concurrency, memory safety and expressiveness while retaining Python's readability and C-like performance. Join us to learn about Rust and take away ideas to overcome common woes in the Python world!",
				"speaker": {
					"name": "Tushar Malik",
					"info": "Are you a Python developer looking to expand your horizons and explore new possibilities? Have you ever wondered about the hype surrounding Rust? Join me for a talk on “Rust for Python Developers,” where we'll decode this hype and explore why Python developers should be interested.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQFFH4vCFAaEkA/profile-displayphoto-shrink_400_400/0/1674634647925?e=1695859200&v=beta&t=koIrA0qCv1kRpt6NKExiyRpFLWUZxqhMbbrQRJLRThE",
					"social": [
						{
							"twitter": "https://twitter.com/ditsukeX",
							"github": "https://github.com/ditsuke",
							"website": "https://ditsuke.com/",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/mtushar00/",
							"proposal": ""
						}
					]
				}
			},
			"27": {
				"type": "Talk",
				"title": "From Logs to Live Data: Building a Multi-Client Log Streaming Service with Python",
				"description": "This talk will showcase how to build a real-time, multi-client log streaming service using Python and Server-Sent Events. Attendees will learn how to create a solution that delivers live log data to multiple clients simultaneously as well as understand the tradeoffs of choosing different technologies.",
				"speaker": {
					"name": "Yuvraj Singh Pathania",
					"info": "Software Engineer @CloudSEK || Backend & AI enthusiast",
					"photo": "https://media.licdn.com/dms/image/C4D03AQE3RNIWF3CRyg/profile-displayphoto-shrink_400_400/0/1662976952085?e=1695859200&v=beta&t=tdbS4gdWBjrmQep-L7Y-5v-uRMbf_fdIP2TP1sjA4Zw",
					"social": [
						{
							"twitter": "https://twitter.com/yuvrajsp01",
							"github": "",
							"website": "https://yuvraj.super.site/",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"28": {
				"type": "default",
				"title": "Lunch",
				"description": "Lunch Time",
				"speaker": {
					"name": "",
					"info": "",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"29": {
				"type": "default",
				"title": "Lightning Talks",
				"description": "4 Lightning Talks",
				"speaker": {
					"name": "",
					"info": "TBD",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"30": {
				"type": "Talk",
				"title": "Scaling celery infrastructure on AWS with Python",
				"description": "If you use celery and struggle with scaling your aws infrastructure for your application queue on AWS, this talk will share the solution that works and scales the application based on the queue.",
				"speaker": {
					"name": "Mohith Bansal",
					"info": "Celery is a distributed system that allows application to process tasks asynchronously and allows task scheduling as well. Along with AMQP brokers and result store, celery allows the task to be processed in real-time.But if your message queues have variable amount of load and needs a scaling solution to help you scale the celery workers based on the load instead of keeping bigger instance running and save cost as well, this talk can be insightful to you.",
					"photo": "https://pbs.twimg.com/profile_images/1222957461201547264/DpQEa7VE_400x400.jpg",
					"social": [
						{
							"twitter": "https://twitter.com/miphilomath",
							"github": "",
							"website": "https://theknowledgeseeker.in/",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"31": {
				"type": "talk",
				"title": "Harnessing the Power of Web Scraping: A Practical Guide with Python",
				"description": "",
				"speaker": {
					"name": "Shloka Shah",
					"info": "Unleash the power of web scraping with Python! Explore traditional techniques and how Python libraries like BeautifulSoup and Scrapy have simplified the process. We will discover how to effortlessly extract valuable data from websites and how we can effectively use it for automation and research.",
					"photo": "https://pbs.twimg.com/profile_images/1640553236804562947/VSRU6PlR_400x400.jpg",
					"social": [
						{
							"twitter": "https://twitter.com/shlokashah0603",
							"github": "",
							"website": "https://blog.shlokashah.com/",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"32": {
				"type": "talk",
				"title": "Three Factors Blocking Contributions to Your Open Source Projects",
				"description": "",
				"speaker": {
					"name": "Saurav Jain",
					"info": "Saurav is an Open Source Evangelist and Pythonista from the last 4 years in the industry; he is also working as a Community Manager at Amplication. He has successfully contributed 100s of new contributors to OS projects in his career.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQFxachL8Q_M-Q/profile-displayphoto-shrink_800_800/0/1680504988942?e=1697673600&v=beta&t=7g_yXfKv_FKo1kwcJjG1A9K1Bf-SIq71Mb9pIgPM4Lk",
					"social": [
						{
							"twitter": "https://twitter.com/Sauain",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/saurav-jain-384625147/",
							"proposal": ""
						}
					]
				}
			},
			"33": {
				"type": "talk",
				"title": "Simplifying API Development in Python: Harnessing Pydantic Models and Mako Templates for Streamlined Validation and Formatting",
				"description": "Validating API requests and formatting responses are integral aspects of the API lifecycle, but the multitude of approaches available can lead to repetitive and convoluted code, making responses complex and difficult to interpret. In this conference talk, we will explore how Pydantic models can be utilized to mitigate repetition by streamlining request validation. Additionally, we will demonstrate the efficacy of storing mock responses to enhance contract visibility. By integrating Mako templates into the development process, we can easily manage cosmetic changes in responses while maintaining the clarity of core services and introduce design first and then develop philosophy. Attendees will gain valuable insights and practical techniques to elevate their Python development process, resulting in more efficient and maintainable APIs.",
				"speaker": {
					"name": "Prashant Chaturvedi",
					"info": "Software Developer at 1MG with 3 years of experience, Prashant is currently working on the common order taking system. He has previously excelled in the diagnostics team, where he managed and enhanced diagnostic systems. Additionally, he contributed significantly to the health records team, successfully implementing real-time digitization of records.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQFJnbxXK9WitQ/profile-displayphoto-shrink_800_800/0/1690461907938?e=1697673600&v=beta&t=MMFApLN_NC18XouUcG4w44L9liR1RJRpjJFEZldRE7w",
					"social": [
						{
							"twitter": "https://twitter.com/prashantchat11",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/prashantvedi11/",
							"proposal": ""
						}
					]
				}
			},
			"34": {
				"type": "talk",
				"title": "Introduction to the World of Research and Research Papers",
				"description": "Researching topics and fields is very important and helpful in education. I have worked extensively in the field of Machine Learning and Deep learning and wrote 4 Conference papers and one journal paper and I am excited to share my journey, motivate the students and help them to start their journey.",
				"speaker": {
					"name": "Arushi Garg",
					"info": "Upcoming Product Intern @Adobe | AWS Cloud Club Captain | Management Head @tnp | AI/ ML Circle Manager @GDSC-IGDTUW | Research Intern @ IGDTUW | HR Core @Innerve | Technical Head - Senior executive team @IEEE A zealous and self-motivated individual, enthusiastically keen to learn and explore. Flexible, reliable, possess excellent time-keeping skills, and always open to new learning opportunities. I sought new opportunities in teaching and tech internships. I have an interest in Machine Learning and Deep Learning and I am also working on my Data Structures and problem-solving skills. I am an enthusiastic researcher and currently working as a research intern under the HOD of the Electronics and Communication Dept, IGDTUW in the field of Machine Learning and Deep Learning.",
					"photo": " https://media.licdn.com/dms/image/C4D03AQG06IeAv3qHJQ/profile-displayphoto-shrink_400_400/0/1653553264483?e=1695859200&v=beta&t=afc6O99ZuyQsCd0e0DsLAnT-XYpj1bvYq-2goXbIZqk",
					"social": [
						{
							"twitter": "https://twitter.com/ArushiSpeaks105",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/arushi-garg105/",
							"proposal": ""
						}
					]
				}
			},
			"35": {
				"type": "default",
				"title": "Evening Tea, Closing Ceremony/Feedback session",
				"description": "",
				"speaker": {
					"name": "",
					"info": "",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			},
			"36": {
				"type": "Workshop",
				"title": "Data Visualisation in Python",
				"description": "",
				"speaker": {
					"name": "Jaidev Deshpande",
					"info": "Associate Director Tech @ Gramener",
					"photo": "https://media.licdn.com/dms/image/C5103AQE_YAqu_x8DmA/profile-displayphoto-shrink_800_800/0/1574873034524?e=1697673600&v=beta&t=xDBIcCZfiJW_f4_GHTtmq6OnDiwzDLNtvKpmYppZD9o",
					"social": [
						{
							"twitter": "https://twitter.com/jaidevd",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/jaidevd/",
							"proposal": ""
						}
					]
				}
			},
			"37": {
				"type": "Workshop",
				"title": "Making apps with Kivy",
				"description": "We will go through a couple of template githib repos that guide you through making a intermediate level kivy app and package it.  There would be a mini sprint to make a app yourself. The best app of the lot would would earn a surprise gift. :)",
				"speaker": {
					"name": "Akshay Arora",
					"info": "",
					"photo": "https://media.licdn.com/dms/image/D4D03AQGTe3rWRTMl3A/profile-displayphoto-shrink_800_800/0/1689768075100?e=1697673600&v=beta&t=vjZDYtw4pJcJ8rNyHK599VAVsKZElcF3rvNaoIv0c84",
					"social": [
						{
							"twitter": "https://twitter.com/quanon_akkshay",
							"github": "https://github.com/akshayaurora",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/quanon/",
							"proposal": ""
						}
					]
				}
			},
			"38": {
				"type": "default",
				"title": "Sanic Unleashed: Mastering Asynchronous Unit Testing in Python",
				"description": "In the fast-paced world of web development, Sanic, a Python web framework, has emerged as a powerful and efficient choice for building high-performance applications. However, ensuring the quality and reliability of Sanic applications requires mastering the art of asynchronous unit testing. Asynchronous code brings unique challenges to the testing landscape, and in this session, we will dive into essential topics, including setting up an optimal testing environment, leveraging Pythonic principles for seamless unit testing, and tackling the intricacies of asynchronous code.",
				"speaker": {
					"name": "Akshita Dixit",
					"info": "Akshita has been working with 1MG for the last 7 months. She works with the Cart Team at the company as a Backend Developer. Apart from her role at 1MG, she is  a Hackathon Coach at MLH (Major League Hacking) and shares her knowledge to inspire and guide aspiring developers. Further she manages MLH Fellows as a Pod Leader for the Fellowship. Beyond her professional engagements, she also does freelance technical writing for tech companies and startups.",
					"photo": "https://media.licdn.com/dms/image/D4D03AQFGx2SO99nJ5A/profile-displayphoto-shrink_800_800/0/1680695651316?e=1697673600&v=beta&t=9s6VHIIl3owoVU1g19Abv9N7jMY9w7GqvbAvIDrKFuY",
					"social": [
						{
							"twitter": "https://twitter.com/plastic96_",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/akshitadixit/",
							"proposal": ""
						}
					]
				}
			},
			"39": {
				"type": "default",
				"title": "Best practices for continuous Integration in python",
				"description": "Continuous integration has become a fundamental process in modern software development, but many Python developers struggle with establishing effective frameworks and standards. In this talk, we will explore practical best practices that empower developers to design efficient continuous integration pipelines for Python services and apps. We will delve into the key aspects of continuous integration and its significance in ensuring code quality, streamlining teamwork, and accelerating project timelines.",
				"speaker": {
					"name": "Dollar Dhingra",
					"info": "",
					"photo": "https://media.licdn.com/dms/image/C4D03AQEwqOCbrP-ndA/profile-displayphoto-shrink_800_800/0/1609328221457?e=1697673600&v=beta&t=nix3o4R_7MC1JFqKObCrtAItcYUbOoSSTM_HNcpNAfc",
					"social": [
						{
							"twitter": "https://twitter.com/dollardhingra13",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "https://www.linkedin.com/in/dollardhingra/",
							"proposal": ""
						}
					]
				}
			},
			"40": {
				"type": "default",
				"title": "BOF",
				"description": "",
				"speaker": {
					"name": "",
					"info": "",
					"photo": "",
					"social": [
						{
							"twitter": "",
							"github": "",
							"website": "",
							"facebook": "",
							"linkedin": "",
							"proposal": ""
						}
					]
				}
			}
		}
	]
}
